app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `name` = 'aditya'
 LIMIT 1
---
    public function login()
{
    $userModel = new UserModel();

    $username = $this->request->getPost('your_name');
    $password = $this->request->getPost('your_pass');

    // Lakukan validasi username dan password
    $user = $userModel->where('name', $username)->first();

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('aditya', 'sisterlocation1@gmail.com', '$2y$10$/P2sGJFy9kRUNyJHC9QriuZB0sgvxTPNNr2IBdc5RVOnWIOAw0HuK')
---
    public function simpanData()
    {
        $userModel = new UserModel();

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('pass'), PASSWORD_DEFAULT),
        ];

        $userModel->insert($data);